app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.new(class_params)
    if @class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-27 16:45:00.297073"], ["updated_at", "2018-11-27 16:45:00.297073"]]

  def update
    @class = SchoolClass.find(params[:id])
    if @class.update(class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-27 16:53:25.338683"], ["id", 1]]