app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-11-27 16:35:12.221267"], ["updated_at", "2018-11-27 16:35:12.221267"]]

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-27 14:03:16.865642"], ["id", 1]]